XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM4_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>FM4_DFP</name>
  <description>Cypress FM4 Series Device Support</description>

  <releases>
    <release version="1.6.0" date="2019-05-28">
      Updated Device Vendor: changed from Spansion to Cypress.
    </release>
    <release version="1.5.1" date="2016-07-12">
      Removed feature description for memories because this is redudant information and the schema does not allow hexadecimal numbers
    </release>
    <release version="1.5.0" date="2016-05-24">
      Added device support: S6E2Gx and S6E2Hx.
      Updated documentation: FM4 Manuals.
      Reorganized device folder structure.
    </release>
    <release version="1.4.0" date="2015-07-16">
      Added S6E2Dx device support.
      Added S6E2Cx device feature description.
      Updated FM4 Manuals.
    </release>
    <release version="1.3.0" date="2014-11-11">
      Added S6E2Cx devices.
      Updated FM4 Manuals.
    </release>
    <release version="1.2.0" date="2014-07-18">
      Added MB9Bx60L series devices.
      Updated MB9Bx60R series devices.
      Reworked devices sections with new subfamilies and device features.
      Updated component Device:Startup CMSIS system header file treated as config file.
    </release>
    <release version="1.1.0" date="2014-07-16">
      Added MB9B160L series devices.
    </release>
    <release version="1.0.1">
      Updated device feature description.
    </release>
    <release version="1.0.0">
      First Release version of FM4 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Cypress</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Cypress</keyword>
    <keyword>FM4</keyword>
    <keyword>MB9B</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="FM4 Series" Dvendor="Cypress:19">
      <book  name="Documents/dui0553a_cortex_m4_dgug.pdf"  title="Cortex-M4 Generic User Guide"/>
      <book  name="Documents/fm4_mn709-00001-e.pdf"        title="FM4 Family Peripheral Manual"/>
      <book  name="Documents/fm4_mn709-00002-e.pdf"        title="FM4 Family Peripheral Manual Timer Part"/>
      <book  name="Documents/fm4_mn709-00003-e.pdf"        title="FM4 Family Peripheral Manual Analog Macro Part"/>
      <book  name="Documents/fm4_mn709-00004-e.pdf"        title="FM4 Family Peripheral Manual Communications Macro Part"/>
      <book  name="Documents/fm4_mn709-00017-e.pdf"        title="FM4 Family Peripheral Manual Ethernet Part"/>
      <description>
The FM4 family of 32-bit, general-purpose MCUs covers the highest end of the product range.
Based on the ARM Cortex-M4F processor core, the family features DSP and Floating Point Unit (FPU) functions.
These MCUs are designed for applications that require advanced, high-speed computing performance such as general-purpose inverters, servomotors, factory automation, PLCs and other industrial equipment, as well as medical and surveillance products, and inverter-based home appliances such as washing machines and air conditioners.
      </description>

      <!-- ************************  Subfamily 'MB9BF160L'  *************************** -->
      <subFamily DsubFamily="MB9BF160L">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="160000000"/>
        <book  name="Documents/MB9B160L_DS709-00008.pdf"  title="MB9B160L Data Sheet"/>
        <debug svd="SVD/MB9B160L.svd"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <algorithm  name="Flash/MB9B560_WORK32.FLM" start="0x200C0000"  size="0x8000"                   default="1"/>

        <feature type="VCC"           n="2.7"     m="5.5"/>
        <feature type="IntRC"         n="4000000"                    name="Built-in CR High-speed (+/- 2%)"/>
        <feature type="IntRC"         n="100000"                     name="Built-in CR Low-speed"/>
        <feature type="DMA"           n="8"                          name="DMA Controller"/>
        <feature type="Other"         n="128"                        name="DSTC Controller (Descriptor System data Transfer Controller) (128 channels)"/>
        <feature type="Timer"         n="8"                          name="Base Timer (Max 8 channels): PWM, PPG, PWC"/>
        <feature type="Timer"         n="1"                          name="Dual Timer (32/16-bit Down Counter)"/>
        <feature type="RTC"           n="1"       m="32768"          name="Real-time clock (RTC)"/>
        <feature type="Timer"         n="1"                          name="Watch Counter"/>
        <feature type="Other"         n="1"                          name="CRC (Cyclic Redundancy Check) Accelerator "/>
        <feature type="WDT"           n="1"                          name="Watchdog Timer (HW + SW)"/>
        <feature type="DAC"           n="2"       m="12"             name="DA converter"/>
        <feature type="Other"         n="1"                          name="Clock Super Visor (CSV)"/>
        <feature type="Other"         n="2"                          name="Low-Voltage Detector (LVD)"/>
        <feature type="MPSerial"      n="6"                          name="Multi-function Serial Interface (Max 6 channels): UART, CSIO, LIN, I2C"/>
        <feature type="Other"         n="1"                          name="Quadrature Position/Revolution Counter (QPRC)"/>

        <!-- *************************  Device 'MB9BF164K'  ***************************** -->
        <device Dname="MB9BF164K">
          <compile header="Device/MB9B160L/Include/mb9b160l.h"  define="MB9BF164K"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003E000"  size="0x4000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_512.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>

          <feature type="Timer"    n="1"              name="Multi-function Timer"/>
          <feature type="IOs"      n="33"             name="I/O Ports"/>
          <feature type="ADC"      n="8"     m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF164L'  ***************************** -->
        <device Dname="MB9BF164L">
          <compile header="Device/MB9B160L/Include/mb9b160l.h"  define="MB9BF164L"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003E000"  size="0x4000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_512.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>

          <feature type="Timer"    n="2"              name="Multi-function Timer (Max 2 units)"/>
          <feature type="IOs"      n="48"             name="I/O Ports"/>
          <feature type="ADC"      n="15"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF165K'  ***************************** -->
        <device Dname="MB9BF165K">
          <compile header="Device/MB9B160L/Include/mb9b160l.h"  define="MB9BF165K"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003D000"  size="0x6000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_512.FLM"    start="0x00000000"  size="0x60000"                  default="1"/>

          <feature type="Timer"    n="1"              name="Multi-function Timer"/>
          <feature type="IOs"      n="33"             name="I/O Ports"/>
          <feature type="ADC"      n="8"     m="12"   name="A/D Converter"/>
        </device>

