XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM4_DFP.pdsc
        <!-- *************************  Device 'MB9BF165L'  ***************************** -->
        <device Dname="MB9BF165L">
          <compile header="Device/MB9B160L/Include/mb9b160l.h"  define="MB9BF165L"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003D000"  size="0x6000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_512.FLM"    start="0x00000000"  size="0x60000"                  default="1"/>

          <feature type="Timer"    n="2"              name="Multi-function Timer (Max 2 units)"/>
          <feature type="IOs"      n="48"             name="I/O Ports"/>
          <feature type="ADC"      n="15"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF166K'  ***************************** -->
        <device Dname="MB9BF166K">
          <compile header="Device/MB9B160L/Include/mb9b160l.h"  define="MB9BF166K"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003C000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_512.FLM"    start="0x00000000"  size="0x80000"                  default="1"/>

          <feature type="Timer"    n="1"              name="Multi-function Timer"/>
          <feature type="IOs"      n="33"             name="I/O Ports"/>
          <feature type="ADC"      n="8"     m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF166L'  ***************************** -->
        <device Dname="MB9BF166L">
          <compile header="Device/MB9B160L/Include/mb9b160l.h"  define="MB9BF166L"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003C000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_512.FLM"    start="0x00000000"  size="0x80000"                  default="1"/>

          <feature type="Timer"    n="2"              name="Multi-function Timer (Max 2 units)"/>
          <feature type="IOs"      n="48"             name="I/O Ports"/>
          <feature type="ADC"      n="15"    m="12"   name="A/D Converter"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'MB9BF160R'  *************************** -->
      <subFamily DsubFamily="MB9BF160R">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="160000000"/>
        <book  name="Documents/MB9B160R-DS709-00004.pdf"  title="MB9B160R Data Sheet"/>
        <debug svd="SVD/MB9B160R.svd"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <algorithm  name="Flash/MB9B560_WORK32.FLM" start="0x200C0000"  size="0x8000"                   default="1"/>

        <feature type="VCC"           n="2.7"     m="5.5"/>
        <feature type="IntRC"         n="4000000"                    name="Built-in CR High-speed (+/- 2%)"/>
        <feature type="IntRC"         n="100000"                     name="Built-in CR Low-speed"/>
        <feature type="DMA"           n="8"                          name="DMA Controller"/>
        <feature type="Other"         n="128"                        name="DSTC Controller (Descriptor System data Transfer Controller) (128 channels)"/>
        <feature type="Timer"         n="8"                          name="Base Timer (Max 8 channels): PWM, PPG, PWC"/>
        <feature type="Timer"         n="1"                          name="Dual Timer (32/16-bit Down Counter)"/>
        <feature type="RTC"           n="1"       m="32768"          name="Real-time clock (RTC)"/>
        <feature type="Timer"         n="1"                          name="Watch Counter"/>
        <feature type="Other"         n="1"                          name="CRC (Cyclic Redundancy Check) Accelerator "/>
        <feature type="WDT"           n="1"                          name="Watchdog Timer (HW + SW)"/>
        <feature type="DAC"           n="2"       m="12"             name="DA converter"/>
        <feature type="Other"         n="1"                          name="Clock Super Visor (CSV)"/>
        <feature type="Other"         n="2"                          name="Low-Voltage Detector (LVD)"/>
        <feature type="MPSerial"      n="8"                          name="Multi-function Serial Interface (Max 8 channels): UART, CSIO, LIN, I2C"/>
        <feature type="Other"         n="2"                          name="Quadrature Position/Revolution Counter (QPRC) (Max 2 channels)"/>
        <feature type="Timer"         n="2"                          name="Multi-function Timer (Max 2 units)"/>
        <feature type="SDIO"          n="1"                          name="SD Card Interface"/>

        <!-- *************************  Device 'MB9BF166M'  ***************************** -->
        <device Dname="MB9BF166M">
          <compile header="Device/MB9B160R/Include/mb9b160r.h"  define="MB9BF166M"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003C000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>

          <feature type="IOs"      n="63"             name="I/O Ports"/>
          <feature type="ADC"      n="16"    m="12"   name="A/D Converter"/>
        </device>

