XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM4_DFP.pdsc
        <!-- *************************  Device 'MB9BF166N'  ***************************** -->
        <device Dname="MB9BF166N">
          <compile header="Device/MB9B160R/Include/mb9b160r.h"  define="MB9BF166N"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003C000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>

          <feature type="IOs"      n="80"             name="I/O Ports"/>
          <feature type="ADC"      n="24"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF166R'  ***************************** -->
        <device Dname="MB9BF166R">
          <compile header="Device/MB9B160R/Include/mb9b160r.h"  define="MB9BF166R"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003C000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>

          <feature type="IOs"      n="100"            name="I/O Ports"/>
          <feature type="ADC"      n="24"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF167M'  ***************************** -->
        <device Dname="MB9BF167M">
          <compile header="Device/MB9B160R/Include/mb9b160r.h"  define="MB9BF167M"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0xC0000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003A000"  size="0xC000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF4000"  size="0xC000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0xC0000"                  default="1"/>

          <feature type="IOs"      n="63"             name="I/O Ports"/>
          <feature type="ADC"      n="16"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF167N'  ***************************** -->
        <device Dname="MB9BF167N">
          <compile header="Device/MB9B160R/Include/mb9b160r.h"  define="MB9BF167N"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0xC0000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003A000"  size="0xC000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF4000"  size="0xC000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0xC0000"                  default="1"/>

          <feature type="IOs"      n="80"             name="I/O Ports"/>
          <feature type="ADC"      n="24"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF167R'  ***************************** -->
        <device Dname="MB9BF167R">
          <compile header="Device/MB9B160R/Include/mb9b160r.h"  define="MB9BF167R"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0xC0000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003A000"  size="0xC000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF4000"  size="0xC000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0xC0000"                  default="1"/>

          <feature type="IOs"      n="100"            name="I/O Ports"/>
          <feature type="ADC"      n="24"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF168M'  ***************************** -->
        <device Dname="MB9BF168M">
          <compile header="Device/MB9B160R/Include/mb9b160r.h"  define="MB9BF168M"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20038000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>

          <feature type="IOs"      n="63"             name="I/O Ports"/>
          <feature type="ADC"      n="16"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF168N'  ***************************** -->
        <device Dname="MB9BF168N">
          <compile header="Device/MB9B160R/Include/mb9b160r.h"  define="MB9BF168N"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20038000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>

          <feature type="IOs"      n="80"             name="I/O Ports"/>
          <feature type="ADC"      n="24"    m="12"   name="A/D Converter"/>
        </device>

