XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM4_DFP.pdsc
        <!-- *************************  Device 'MB9BF168R'  ***************************** -->
        <device Dname="MB9BF168R">
          <compile header="Device/MB9B160R/Include/mb9b160r.h"  define="MB9BF168R"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20038000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>

          <feature type="IOs"      n="100"            name="I/O Ports"/>
          <feature type="ADC"      n="24"    m="12"   name="A/D Converter"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'MB9BF360L'  *************************** -->
      <subFamily DsubFamily="MB9BF360L">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="160000000"/>
        <book  name="Documents/MB9B360L_DS709-00007.pdf"  title="MB9B360L Data Sheet"/>
        <debug svd="SVD/MB9B360L.svd"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <algorithm  name="Flash/MB9B560_WORK32.FLM" start="0x200C0000"  size="0x8000"                   default="1"/>

        <feature type="VCC"           n="2.7"     m="5.5"/>
        <feature type="IntRC"         n="4000000"                    name="Built-in CR High-speed (+/- 2%)"/>
        <feature type="IntRC"         n="100000"                     name="Built-in CR Low-speed"/>
        <feature type="DMA"           n="8"                          name="DMA Controller"/>
        <feature type="Other"         n="128"                        name="DSTC Controller (Descriptor System data Transfer Controller) (128 channels)"/>
        <feature type="Timer"         n="8"                          name="Base Timer (Max 8 channels): PWM, PPG, PWC"/>
        <feature type="Timer"         n="1"                          name="Dual Timer (32/16-bit Down Counter)"/>
        <feature type="RTC"           n="1"       m="32768"          name="Real-time clock (RTC)"/>
        <feature type="Timer"         n="1"                          name="Watch Counter"/>
        <feature type="Other"         n="1"                          name="CRC (Cyclic Redundancy Check) Accelerator "/>
        <feature type="WDT"           n="1"                          name="Watchdog Timer (HW + SW)"/>
        <feature type="DAC"           n="2"       m="12"             name="DA converter"/>
        <feature type="Other"         n="1"                          name="Clock Super Visor (CSV)"/>
        <feature type="Other"         n="2"                          name="Low-Voltage Detector (LVD)"/>
        <feature type="MPSerial"      n="6"                          name="Multi-function Serial Interface (Max 6 channels): UART, CSIO, LIN, I2C"/>
        <feature type="Other"         n="1"                          name="Quadrature Position/Revolution Counter (QPRC)"/>
        <feature type="ComOther"      n="1"                          name="USB 2.0 (Function / Host)"/>

        <!-- *************************  Device 'MB9BF364K'  ***************************** -->
        <device Dname="MB9BF364K">
          <compile header="Device/MB9B360L/Include/mb9b360l.h"  define="MB9BF364K"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003E000"  size="0x4000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_512.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>

          <feature type="Timer"    n="1"              name="Multi-function Timer"/>
          <feature type="IOs"      n="33"             name="I/O Ports"/>
          <feature type="ADC"      n="8"     m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF364L'  ***************************** -->
        <device Dname="MB9BF364L">
          <compile header="Device/MB9B360L/Include/mb9b360l.h"  define="MB9BF364L"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003E000"  size="0x4000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_512.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>

          <feature type="Timer"    n="2"              name="Multi-function Timer (Max 2 units)"/>
          <feature type="IOs"      n="48"             name="I/O Ports"/>
          <feature type="ADC"      n="15"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF365K'  ***************************** -->
        <device Dname="MB9BF365K">
          <compile header="Device/MB9B360L/Include/mb9b360l.h"  define="MB9BF365K"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003D000"  size="0x6000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_512.FLM"    start="0x00000000"  size="0x60000"                  default="1"/>

          <feature type="Timer"    n="1"              name="Multi-function Timer"/>
          <feature type="IOs"      n="33"             name="I/O Ports"/>
          <feature type="ADC"      n="8"     m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF365L'  ***************************** -->
        <device Dname="MB9BF365L">
          <compile header="Device/MB9B360L/Include/mb9b360l.h"  define="MB9BF365L"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003D000"  size="0x6000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_512.FLM"    start="0x00000000"  size="0x60000"                  default="1"/>

          <feature type="Timer"    n="2"              name="Multi-function Timer (Max 2 units)"/>
          <feature type="IOs"      n="48"             name="I/O Ports"/>
          <feature type="ADC"      n="15"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF366K'  ***************************** -->
        <device Dname="MB9BF366K">
          <compile header="Device/MB9B360L/Include/mb9b360l.h"  define="MB9BF366K"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003C000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_512.FLM"    start="0x00000000"  size="0x80000"                  default="1"/>

          <feature type="Timer"    n="1"              name="Multi-function Timer"/>
          <feature type="IOs"      n="33"             name="I/O Ports"/>
          <feature type="ADC"      n="8"     m="12"   name="A/D Converter"/>
        </device>

