XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM4_DFP.pdsc
        <!-- *************************  Device 'MB9BF466N'  ***************************** -->
        <device Dname="MB9BF466N">
          <compile header="Device/MB9B460R/Include/mb9b460r.h"  define="MB9BF466N"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003C000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, SDRAM)"/>
          <feature type="IOs"      n="80"             name="I/O Ports"/>
          <feature type="ADC"      n="24"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF466R'  ***************************** -->
        <device Dname="MB9BF466R">
          <compile header="Device/MB9B460R/Include/mb9b460r.h"  define="MB9BF466R"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003C000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="IOs"      n="100"            name="I/O Ports"/>
          <feature type="ADC"      n="24"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF467M'  ***************************** -->
        <device Dname="MB9BF467M">
          <compile header="Device/MB9B460R/Include/mb9b460r.h"  define="MB9BF467M"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0xC0000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003A000"  size="0xC000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF4000"  size="0xC000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0xC0000"                  default="1"/>

          <feature type="ExtBus"   n="8"              name="External Bus Interface (SRAM, NOR Flash)"/>
          <feature type="IOs"      n="63"             name="I/O Ports"/>
          <feature type="ADC"      n="16"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF467N'  ***************************** -->
        <device Dname="MB9BF467N">
          <compile header="Device/MB9B460R/Include/mb9b460r.h"  define="MB9BF467N"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0xC0000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003A000"  size="0xC000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF4000"  size="0xC000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0xC0000"                  default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, SDRAM)"/>
          <feature type="IOs"      n="80"             name="I/O Ports"/>
          <feature type="ADC"      n="24"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF467R'  ***************************** -->
        <device Dname="MB9BF467R">
          <compile header="Device/MB9B460R/Include/mb9b460r.h"  define="MB9BF467R"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0xC0000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003A000"  size="0xC000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF4000"  size="0xC000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0xC0000"                  default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="IOs"      n="100"            name="I/O Ports"/>
          <feature type="ADC"      n="24"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF468M'  ***************************** -->
        <device Dname="MB9BF468M">
          <compile header="Device/MB9B460R/Include/mb9b460r.h"  define="MB9BF468M"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20038000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>

          <feature type="ExtBus"   n="8"              name="External Bus Interface (SRAM, NOR Flash)"/>
          <feature type="IOs"      n="63"             name="I/O Ports"/>
          <feature type="ADC"      n="16"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF468N'  ***************************** -->
        <device Dname="MB9BF468N">
          <compile header="Device/MB9B460R/Include/mb9b460r.h"  define="MB9BF468N"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20038000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>

