XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM4_DFP.pdsc
          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, SDRAM)"/>
          <feature type="IOs"      n="80"             name="I/O Ports"/>
          <feature type="ADC"      n="24"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF567R'  ***************************** -->
        <device Dname="MB9BF567R">
          <compile header="Device/MB9B560R/Include/mb9b560r.h"  define="MB9BF567R"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0xC0000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x2003A000"  size="0xC000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF4000"  size="0xC000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0xC0000"                  default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="IOs"      n="100"            name="I/O Ports"/>
          <feature type="ADC"      n="24"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF568M'  ***************************** -->
        <device Dname="MB9BF568M">
          <compile header="Device/MB9B560R/Include/mb9b560r.h"  define="MB9BF568M"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20038000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>

          <feature type="ExtBus"   n="8"              name="External Bus Interface (SRAM, NOR Flash)"/>
          <feature type="IOs"      n="63"             name="I/O Ports"/>
          <feature type="ADC"      n="16"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF568N'  ***************************** -->
        <device Dname="MB9BF568N">
          <compile header="Device/MB9B560R/Include/mb9b560r.h"  define="MB9BF568N"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20038000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, SDRAM)"/>
          <feature type="IOs"      n="80"             name="I/O Ports"/>
          <feature type="ADC"      n="24"    m="12"   name="A/D Converter"/>
        </device>

        <!-- *************************  Device 'MB9BF568R'  ***************************** -->
        <device Dname="MB9BF568R">
          <compile header="Device/MB9B560R/Include/mb9b560r.h"  define="MB9BF568R"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20038000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/MB9B560_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="IOs"      n="100"            name="I/O Ports"/>
          <feature type="ADC"      n="24"    m="12"   name="A/D Converter"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'S6E2C1'  *************************** -->
      <subFamily DsubFamily="S6E2C1">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="200000000"/>
        <book name="Documents/s6e2c1_ds709-00014-e.pdf" title="S6E2C1 Data Sheet"/>
        <debug svd="SVD/S6E2C1.svd"/>
        <memory     id="IROM2"                              start="0x00406000" size="0xA000"   startup="0" default="1"/>
        <memory     id="IRAM2"                              start="0x20038000" size="0x10000"  init   ="0" default="0"/>
        <algorithm  name="Flash/S6E2CC_MACRO0_8KB.FLM"      start="0x00406000" size="0x2000"   RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
        <algorithm  name="Flash/S6E2CC_MACRO1_32KB.FLM"     start="0x00408000" size="0x8000"   RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

        <feature type="NVIC"          n="128"                        name="NVIC"/>
        <feature type="VCC"           n="2.7"     m="5.5"/>
        <feature type="DMA"           n="8"                          name="DMA Controller"/>
        <feature type="Other"         n="256"                        name="DSTC (Descriptor System data Transfer) Controller"/>
        <feature type="MPSerial"      n="16"                         name="Multi-function Serial Interface (Max 16 channels): UART, CSIO, LIN, I2C"/>
        <feature type="Timer"         n="16"                         name="Base Timer (Max 16 channels): PWM, PPG, PWC, Reload"/>
        <feature type="Timer"         n="3"                          name="Multi-function Timer (Max 3 units)"/>
        <feature type="SDIO"          n="1"       m="4"              name="SD Card Interface"/>
        <feature type="Other"         n="1"                          name="HDMI-CEC / Remote Control Reception"/>
        <feature type="Other"         n="4"                          name="Quadrature Position/Revolution Counter (QPRC)"/>
        <feature type="Timer"         n="1"                          name="Dual Timer (32/16-bit Down Counter)"/>
        <feature type="RTC"           n="1"       m="32768"          name="Real-time clock (RTC)"/>
        <feature type="Timer"         n="1"                          name="Watch Counter"/>
        <feature type="Other"         n="1"                          name="CRC (Cyclic Redundancy Check) Accelerator "/>
        <feature type="WDT"           n="1"                          name="Watchdog Timer (HW + SW)"/>
        <feature type="ExtInt"        n="32"                         name="External Interrupts (Max 32 pins"/>
        <feature type="DAC"           n="2"       m="12"             name="DA converter (Max 2 channels)"/>
        <feature type="Other"         n="1"                          name="Clock Super Visor (CSV)"/>
        <feature type="Other"         n="2"                          name="Low-Voltage Detector (LVD)"/>
        <feature type="IntRC"         n="4000000"                    name="Built-in CR High-speed (+/- 2%)"/>
        <feature type="IntRC"         n="100000"                     name="Built-in CR Low-speed"/>
        <feature type="CoreOther"     n="1"                          name="Unique Identifier"/>

