XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM4_DFP.pdsc
        <!-- *************************  Device 'S6E2C18H0A'  ***************************** -->
        <device Dname="S6E2C18H0A">
          <compile header="Device/S6E2C1/Include/s6e2c1.h"  define="S6E2C18H0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x100000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFF0000" size="0x10000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash)"/>
          <feature type="ADC"      n="24"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="120"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2C18J0A'  ***************************** -->
        <device Dname="S6E2C18J0A">
          <compile header="Device/S6E2C1/Include/s6e2c1.h"  define="S6E2C18J0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x100000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFF0000" size="0x10000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="I2S"      n="1"/>
          <feature type="SPI"      n="1"              name="High-speed quad SPI"/>
          <feature type="ADC"      n="32"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="152"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2C18L0A'  ***************************** -->
        <device Dname="S6E2C18L0A">
          <compile header="Device/S6E2C1/Include/s6e2c1.h"  define="S6E2C18L0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x100000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFF0000" size="0x10000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="I2S"      n="1"/>
          <feature type="SPI"      n="1"              name="High-speed quad SPI"/>
          <feature type="ADC"      n="24"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="190"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2C19H0A'  ***************************** -->
        <device Dname="S6E2C19H0A">
          <compile header="Device/S6E2C1/Include/s6e2c1.h"  define="S6E2C19H0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x180000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFE0000" size="0x20000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO1_1024KB.FLM" start="0x00100000" size="0x080000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash)"/>
          <feature type="ADC"      n="24"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="120"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2C19J0A'  ***************************** -->
        <device Dname="S6E2C19J0A">
          <compile header="Device/S6E2C1/Include/s6e2c1.h"  define="S6E2C19J0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x180000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFE0000" size="0x20000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO1_1024KB.FLM" start="0x00100000" size="0x080000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="I2S"      n="1"/>
          <feature type="SPI"      n="1"              name="High-speed quad SPI"/>
          <feature type="ADC"      n="32"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="152"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2C19L0A'  ***************************** -->
        <device Dname="S6E2C19L0A">
          <compile header="Device/S6E2C1/Include/s6e2c1.h"  define="S6E2C19L0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x180000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFE0000" size="0x20000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO1_1024KB.FLM" start="0x00100000" size="0x080000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="I2S"      n="1"/>
          <feature type="SPI"      n="1"              name="High-speed quad SPI"/>
          <feature type="ADC"      n="24"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="190"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2C1AH0A'  ***************************** -->
        <device Dname="S6E2C1AH0A">
          <compile header="Device/S6E2C1/Include/s6e2c1.h"  define="S6E2C1AH0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x200000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFD0000" size="0x30000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO1_1024KB.FLM" start="0x00100000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash)"/>
          <feature type="ADC"      n="24"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="120"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2C1AJ0A'  ***************************** -->
        <device Dname="S6E2C1AJ0A">
          <compile header="Device/S6E2C1/Include/s6e2c1.h"  define="S6E2C1AJ0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x200000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFD0000" size="0x30000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO1_1024KB.FLM" start="0x00100000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="I2S"      n="1"/>
          <feature type="SPI"      n="1"              name="High-speed quad SPI"/>
          <feature type="ADC"      n="32"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="152"            name="I/O Ports"/>
        </device>

