XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM4_DFP.pdsc
        <!-- *************************  Device 'S6E2C39H0A'  ***************************** -->
        <device Dname="S6E2C39H0A">
          <compile header="Device/S6E2C3/Include/s6e2c3.h"  define="S6E2C39H0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x180000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFE0000" size="0x20000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO1_1024KB.FLM" start="0x00100000" size="0x080000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash)"/>
          <feature type="ADC"      n="24"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="120"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2C39J0A'  ***************************** -->
        <device Dname="S6E2C39J0A">
          <compile header="Device/S6E2C3/Include/s6e2c3.h"  define="S6E2C39J0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x180000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFE0000" size="0x20000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO1_1024KB.FLM" start="0x00100000" size="0x080000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="I2S"      n="1"/>
          <feature type="SPI"      n="1"              name="High-speed quad SPI"/>
          <feature type="ADC"      n="32"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="152"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2C39L0A'  ***************************** -->
        <device Dname="S6E2C39L0A">
          <compile header="Device/S6E2C3/Include/s6e2c3.h"  define="S6E2C39L0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x180000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFE0000" size="0x20000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO1_1024KB.FLM" start="0x00100000" size="0x080000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="I2S"      n="1"/>
          <feature type="SPI"      n="1"              name="High-speed quad SPI"/>
          <feature type="ADC"      n="24"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="190"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2C3AH0A'  ***************************** -->
        <device Dname="S6E2C3AH0A">
          <compile header="Device/S6E2C3/Include/s6e2c3.h"  define="S6E2C3AH0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x200000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFD0000" size="0x30000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO1_1024KB.FLM" start="0x00100000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash)"/>
          <feature type="ADC"      n="24"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="120"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2C3AJ0A'  ***************************** -->
        <device Dname="S6E2C3AJ0A">
          <compile header="Device/S6E2C3/Include/s6e2c3.h"  define="S6E2C3AJ0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x200000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFD0000" size="0x30000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO1_1024KB.FLM" start="0x00100000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="I2S"      n="1"/>
          <feature type="SPI"      n="1"              name="High-speed quad SPI"/>
          <feature type="ADC"      n="32"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="152"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2C3AL0A'  ***************************** -->
        <device Dname="S6E2C3AL0A">
          <compile header="Device/S6E2C3/Include/s6e2c3.h"  define="S6E2C3AL0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x200000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFD0000" size="0x30000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO1_1024KB.FLM" start="0x00100000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="I2S"      n="1"/>
          <feature type="SPI"      n="1"              name="High-speed quad SPI"/>
          <feature type="ADC"      n="24"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="190"            name="I/O Ports"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'S6E2C4'  *************************** -->
      <subFamily DsubFamily="S6E2C4">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="200000000"/>
        <book name="Documents/s6e2c4_ds709-00011-e.pdf" title="S6E2C4 Data Sheet"/>
        <debug svd="SVD/S6E2C4.svd"/>
        <memory     id="IROM2"                              start="0x00406000" size="0xA000"   startup="0" default="1"/>
        <memory     id="IRAM2"                              start="0x20038000" size="0x10000"  init   ="0" default="0"/>
        <algorithm  name="Flash/S6E2CC_MACRO0_8KB.FLM"      start="0x00406000" size="0x2000"   RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
        <algorithm  name="Flash/S6E2CC_MACRO1_32KB.FLM"     start="0x00408000" size="0x8000"   RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

        <feature type="NVIC"          n="128"                        name="NVIC"/>
        <feature type="VCC"           n="2.7"     m="5.5"/>
        <feature type="CAN"           n="2"                          name="CAN 2.0 A/B (Max 2 channels)"/>
        <feature type="CAN"           n="1"                          name="CAN FD V1.0"/>
        <feature type="DMA"           n="8"                          name="DMA Controller"/>
        <feature type="Other"         n="256"                        name="DSTC (Descriptor System data Transfer) Controller"/>
        <feature type="MPSerial"      n="16"                         name="Multi-function Serial Interface (Max 16 channels): UART, CSIO, LIN, I2C"/>
        <feature type="Timer"         n="16"                         name="Base Timer (Max 16 channels): PWM, PPG, PWC, Reload"/>
        <feature type="Timer"         n="3"                          name="Multi-function Timer (Max 3 units)"/>
        <feature type="SDIO"          n="1"       m="4"              name="SD Card Interface"/>
        <feature type="Other"         n="1"                          name="HDMI-CEC / Remote Control Reception"/>
        <feature type="Other"         n="4"                          name="Quadrature Position/Revolution Counter (QPRC)"/>
        <feature type="Timer"         n="1"                          name="Dual Timer (32/16-bit Down Counter)"/>
        <feature type="RTC"           n="1"       m="32768"          name="Real-time clock (RTC)"/>
        <feature type="Timer"         n="1"                          name="Watch Counter"/>
        <feature type="Other"         n="1"                          name="CRC (Cyclic Redundancy Check) Accelerator "/>
        <feature type="WDT"           n="1"                          name="Watchdog Timer (HW + SW)"/>
        <feature type="ExtInt"        n="32"                         name="External Interrupts (Max 32 pins"/>
        <feature type="DAC"           n="2"       m="12"             name="DA converter (Max 2 channels)"/>
        <feature type="Other"         n="1"                          name="Clock Super Visor (CSV)"/>
        <feature type="Other"         n="2"                          name="Low-Voltage Detector (LVD)"/>
        <feature type="IntRC"         n="4000000"                    name="Built-in CR High-speed (+/- 2%)"/>
        <feature type="IntRC"         n="100000"                     name="Built-in CR Low-speed"/>
        <feature type="CoreOther"     n="1"                          name="Unique Identifier"/>

        <!-- *************************  Device 'S6E2C48H0A'  ***************************** -->
        <device Dname="S6E2C48H0A">
          <compile header="Device/S6E2C4/Include/s6e2c4.h"  define="S6E2C48H0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x100000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFF0000" size="0x10000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash)"/>
          <feature type="ADC"      n="24"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="120"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2C48J0A'  ***************************** -->
        <device Dname="S6E2C48J0A">
          <compile header="Device/S6E2C4/Include/s6e2c4.h"  define="S6E2C48J0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x100000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFF0000" size="0x10000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="I2S"      n="1"/>
          <feature type="SPI"      n="1"              name="High-speed quad SPI"/>
          <feature type="ADC"      n="32"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="152"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2C48L0A'  ***************************** -->
        <device Dname="S6E2C48L0A">
          <compile header="Device/S6E2C4/Include/s6e2c4.h"  define="S6E2C48L0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x100000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFF0000" size="0x10000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="I2S"      n="1"/>
          <feature type="SPI"      n="1"              name="High-speed quad SPI"/>
          <feature type="ADC"      n="24"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="190"            name="I/O Ports"/>
        </device>

