XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM4_DFP.pdsc
        <!-- *************************  Device 'S6E2CC8J0A'  ***************************** -->
        <device Dname="S6E2CC8J0A">
          <compile header="Device/S6E2CC/Include/s6e2cc.h"  define="S6E2CC8J0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x100000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFF0000" size="0x10000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="I2S"      n="1"/>
          <feature type="SPI"      n="1"              name="High-speed quad SPI"/>
          <feature type="ADC"      n="32"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="152"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2CC8L0A'  ***************************** -->
        <device Dname="S6E2CC8L0A">
          <compile header="Device/S6E2CC/Include/s6e2cc.h"  define="S6E2CC8L0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x100000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFF0000" size="0x10000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="I2S"      n="1"/>
          <feature type="SPI"      n="1"              name="High-speed quad SPI"/>
          <feature type="ADC"      n="24"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="190"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2CC9H0A'  ***************************** -->
        <device Dname="S6E2CC9H0A">
          <compile header="Device/S6E2CC/Include/s6e2cc.h"  define="S6E2CC9H0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x180000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFE0000" size="0x20000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO1_1024KB.FLM" start="0x00100000" size="0x080000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash)"/>
          <feature type="ADC"      n="24"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="120"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2CC9J0A'  ***************************** -->
        <device Dname="S6E2CC9J0A">
          <compile header="Device/S6E2CC/Include/s6e2cc.h"  define="S6E2CC9J0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x180000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFE0000" size="0x20000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO1_1024KB.FLM" start="0x00100000" size="0x080000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="I2S"      n="1"/>
          <feature type="SPI"      n="1"              name="High-speed quad SPI"/>
          <feature type="ADC"      n="32"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="152"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2CC9L0A'  ***************************** -->
        <device Dname="S6E2CC9L0A">
          <compile header="Device/S6E2CC/Include/s6e2cc.h"  define="S6E2CC9L0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x180000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFE0000" size="0x20000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO1_1024KB.FLM" start="0x00100000" size="0x080000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="I2S"      n="1"/>
          <feature type="SPI"      n="1"              name="High-speed quad SPI"/>
          <feature type="ADC"      n="24"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="190"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2CCAH0A'  ***************************** -->
        <device Dname="S6E2CCAH0A">
          <compile header="Device/S6E2CC/Include/s6e2cc.h"  define="S6E2CCAH0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x200000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFD0000" size="0x30000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO1_1024KB.FLM" start="0x00100000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash)"/>
          <feature type="ADC"      n="24"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="120"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2CCAJ0A'  ***************************** -->
        <device Dname="S6E2CCAJ0A">
          <compile header="Device/S6E2CC/Include/s6e2cc.h"  define="S6E2CCAJ0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x200000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFD0000" size="0x30000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO1_1024KB.FLM" start="0x00100000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="I2S"      n="1"/>
          <feature type="SPI"      n="1"              name="High-speed quad SPI"/>
          <feature type="ADC"      n="32"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="152"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2CCAL0A'  ***************************** -->
        <device Dname="S6E2CCAL0A">
          <compile header="Device/S6E2CC/Include/s6e2cc.h"  define="S6E2CCAL0A"/>
          <memory     id="IROM1"                            start="0x00000000" size="0x200000" startup="1" default="1"/>
          <memory     id="IRAM1"                            start="0x1FFD0000" size="0x30000"  init   ="0" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO0_1024KB.FLM" start="0x00000000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>
          <algorithm  name="Flash/S6E2CC_MACRO1_1024KB.FLM" start="0x00100000" size="0x100000" RAMstart="0x2003C000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"   n="16"             name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
          <feature type="I2S"      n="1"/>
          <feature type="SPI"      n="1"              name="High-speed quad SPI"/>
          <feature type="ADC"      n="24"      m="12" name="A/D Converter"/>
          <feature type="IOs"      n="190"            name="I/O Ports"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'S6E2D3'  *************************** -->
      <subFamily DsubFamily="S6E2D3">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="160000000"/>
        <book name="Documents/s6e2d3_ds709-00023-e.pdf" title="S6E2D3 Data Sheet"/>
        <debug svd="SVD/S6E2D3.svd"/>
        <memory id="IROM1"                     start="0x00000000" size="0x00060000" startup="1" default="1"/>
        <memory id="IRAM1"                     start="0x1FFF8000" size="0x00008000" init   ="0" default="1"/>
        <memory id="IRAM2"                     start="0x20040000" size="0x00001000" init   ="0" default="0"/>
        <algorithm name="Flash/S6E2D3_384.FLM" start="0x00000000" size="0x00060000" RAMstart="0x20040000" RAMsize="0x1000" default="1"/>

        <feature type="NVIC"          n="128"                        name="NVIC"/>
        <feature type="VCC"           n="2.7"     m="3.6"/>
        <feature type="ComOther"      n="1"                          name="USB 2.0 (Function / Host)"/>
        <feature type="DMA"           n="8"                          name="DMA Controller"/>
        <feature type="Other"         n="128"                        name="DSTC (Descriptor System data Transfer) Controller (128 channels)"/>
        <feature type="Other"         n="1"                          name="GDC (Graphics Display Controller) Unit"/>
        <feature type="ExtBus"        n="16"                         name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
        <feature type="MPSerial"      n="8"                          name="Multi-function Serial Interface (Max 8 channels): UART, CSIO, LIN, I2C"/>
        <feature type="Timer"         n="8"                          name="Base Timer (Max 8 channels): PWM, PPG, PWC"/>
        <feature type="Timer"         n="1"                          name="Multi-function Timer"/>
        <feature type="I2S"           n="2"/>
        <feature type="Other"         n="1"                          name="Quadrature Position/Revolution Counter (QPRC)"/>
        <feature type="Timer"         n="1"                          name="Dual Timer (32/16-bit Down Counter)"/>
        <feature type="RTC"           n="1"       m="32768"          name="Real-time clock (RTC)"/>
        <feature type="Timer"         n="1"                          name="Watch Counter"/>
        <feature type="Other"         n="1"                          name="CRC (Cyclic Redundancy Check) Accelerator "/>
        <feature type="WDT"           n="1"                          name="Watchdog Timer (HW + SW)"/>
        <feature type="ExtInt"        n="16"                         name="External Interrupts (Max 16 pins"/>
        <feature type="ADC"           n="24"      m="12"             name="A/D Converter"/>
        <feature type="Other"         n="1"                          name="Clock Super Visor (CSV)"/>
        <feature type="Other"         n="2"                          name="Low-Voltage Detector (LVD)"/>
        <feature type="IntRC"         n="4000000"                    name="Built-in CR High-speed (+/- 2%)"/>
        <feature type="IntRC"         n="100000"                     name="Built-in CR Low-speed"/>
        <feature type="CoreOther"     n="1"                          name="Unique Identifier"/>

        <!-- *************************  Device 'S6E2D35G0A'  ***************************** -->
        <device Dname="S6E2D35G0A">
          <compile header="Device/S6E2D3/Include/s6e2d3.h"  define="S6E2D35G0A"/>

          <feature type="IOs"      n="98"             name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2D35GAA'  ***************************** -->
        <device Dname="S6E2D35GAA">
          <compile header="Device/S6E2D3/Include/s6e2d3.h"  define="S6E2D35GAA"/>

          <feature type="IOs"      n="154"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2D35GJA'  ***************************** -->
        <device Dname="S6E2D35GJA">
          <compile header="Device/S6E2D3/Include/s6e2d3.h"  define="S6E2D35GJA"/>

          <feature type="IOs"      n="90"             name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2D35J0A'  ***************************** -->
        <device Dname="S6E2D35J0A">
          <compile header="Device/S6E2D3/Include/s6e2d3.h"  define="S6E2D35J0A"/>

          <feature type="IOs"      n="98"             name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2D35JAA'  ***************************** -->
        <device Dname="S6E2D35JAA">
          <compile header="Device/S6E2D3/Include/s6e2d3.h"  define="S6E2D35JAA"/>

          <feature type="IOs"      n="154"            name="I/O Ports"/>
        </device>
      </subFamily>

