XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM4_DFP.pdsc
        <!-- *************************  Device 'S6E2DF5GAA'  ***************************** -->
        <device Dname="S6E2DF5GAA">
          <compile header="Device/S6E2DF/Include/s6e2df.h"  define="S6E2DF5GAA"/>

          <feature type="IOs"      n="154"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2DF5GJA'  ***************************** -->
        <device Dname="S6E2DF5GJA">
          <compile header="Device/S6E2DF/Include/s6e2df.h"  define="S6E2DF5GJA"/>

          <feature type="IOs"      n="90"             name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2DF5J0A'  ***************************** -->
        <device Dname="S6E2DF5J0A">
          <compile header="Device/S6E2DF/Include/s6e2df.h"  define="S6E2DF5J0A"/>

          <feature type="IOs"      n="98"             name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2DF5JAA'  ***************************** -->
        <device Dname="S6E2DF5JAA">
          <compile header="Device/S6E2DF/Include/s6e2df.h"  define="S6E2DF5JAA"/>

          <feature type="IOs"      n="154"            name="I/O Ports"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'S6E2DH'  *************************** -->
      <subFamily DsubFamily="S6E2DH">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="160000000"/>
        <book name="Documents/s6e2dh_ds709-00029-e.pdf" title="S6E2DH Data Sheet"/>
        <debug svd="SVD/S6E2DH.svd"/>
        <memory id="IROM1"                     start="0x00000000" size="0x00060000" startup="1" default="1"/>
        <memory id="IRAM1"                     start="0x1FFF8000" size="0x00008000" init   ="0" default="1"/>
        <memory id="IRAM2"                     start="0x20040000" size="0x00001000" init   ="0" default="0"/>
        <algorithm name="Flash/S6E2DH_384.FLM" start="0x00000000" size="0x00060000" RAMstart="0x20040000" RAMsize="0x1000" default="1"/>

        <feature type="NVIC"          n="128"                        name="NVIC"/>
        <feature type="VCC"           n="2.7"     m="3.6"/>
        <feature type="ComOther"      n="1"                          name="USB 2.0 (Function / Host)"/>
        <feature type="CAN"           n="1"                          name="CAN 2.0 A/B Controller"/>
        <feature type="DMA"           n="8"                          name="DMA Controller"/>
        <feature type="Other"         n="128"                        name="DSTC (Descriptor System data Transfer) Controller (128 channels)"/>
        <feature type="Other"         n="1"                          name="GDC (Graphics Display Controller) Unit"/>
        <feature type="ExtBus"        n="16"                         name="External Bus Interface (SRAM, NOR Flash, NAND Flash, SDRAM)"/>
        <feature type="MPSerial"      n="8"                          name="Multi-function Serial Interface (Max 8 channels): UART, CSIO, LIN, I2C"/>
        <feature type="Timer"         n="8"                          name="Base Timer (Max 8 channels): PWM, PPG, PWC"/>
        <feature type="Timer"         n="1"                          name="Multi-function Timer"/>
        <feature type="SDIO"          n="1"       m="4"              name="SD Card Interface"/>
        <feature type="I2S"           n="2"/>
        <feature type="Other"         n="1"                          name="Quadrature Position/Revolution Counter (QPRC)"/>
        <feature type="Timer"         n="1"                          name="Dual Timer (32/16-bit Down Counter)"/>
        <feature type="RTC"           n="1"       m="32768"          name="Real-time clock (RTC)"/>
        <feature type="Timer"         n="1"                          name="Watch Counter"/>
        <feature type="Other"         n="1"                          name="CRC (Cyclic Redundancy Check) Accelerator "/>
        <feature type="WDT"           n="1"                          name="Watchdog Timer (HW + SW)"/>
        <feature type="ExtInt"        n="16"                         name="External Interrupts (Max 16 pins"/>
        <feature type="ADC"           n="24"      m="12"             name="A/D Converter"/>
        <feature type="Other"         n="1"                          name="Clock Super Visor (CSV)"/>
        <feature type="Other"         n="2"                          name="Low-Voltage Detector (LVD)"/>
        <feature type="IntRC"         n="4000000"                    name="Built-in CR High-speed (+/- 2%)"/>
        <feature type="IntRC"         n="100000"                     name="Built-in CR Low-speed"/>
        <feature type="CoreOther"     n="1"                          name="Unique Identifier"/>

        <!-- *************************  Device 'S6E2DH5G0A'  ***************************** -->
        <device Dname="S6E2DH5G0A">
          <compile header="Device/S6E2DH/Include/s6e2dh.h"  define="S6E2DH5G0A"/>

          <feature type="IOs"      n="98"             name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2DH5GAA'  ***************************** -->
        <device Dname="S6E2DH5GAA">
          <compile header="Device/S6E2DH/Include/s6e2dh.h"  define="S6E2DH5GAA"/>

          <feature type="IOs"      n="154"            name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2DH5GJA'  ***************************** -->
        <device Dname="S6E2DH5GJA">
          <compile header="Device/S6E2DH/Include/s6e2dh.h"  define="S6E2DH5GJA"/>

          <feature type="IOs"      n="90"             name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2DH5J0A'  ***************************** -->
        <device Dname="S6E2DH5J0A">
          <compile header="Device/S6E2DH/Include/s6e2dh.h"  define="S6E2DH5J0A"/>

          <feature type="IOs"      n="98"             name="I/O Ports"/>
        </device>

        <!-- *************************  Device 'S6E2DH5JAA'  ***************************** -->
        <device Dname="S6E2DH5JAA">
          <compile header="Device/S6E2DH/Include/s6e2dh.h"  define="S6E2DH5JAA"/>

          <feature type="IOs"      n="154"            name="I/O Ports"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'S6E2G2'  *************************** -->
      <subFamily DsubFamily="S6E2G2">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="180000000"/>
        <book name="Documents/3089331-001-99446.pdf" title="S6E2G2 Datasheet"/>
        <memory id="IROM2"                        start="0x00406000" size="0x00002000" startup="0" default="1"/>
        <memory id="IRAM2"                        start="0x20038000" size="0x00010000" init="0"    default="0"/>
        <algorithm name="Flash/S6E2G2XX0A8KB.FLM" start="0x00406000" size="0x00002000" RAMstart="0x20040000" RAMsize="0x1000" default="1"/>

        <feature type="NVIC"          n="128"                        name="NVIC"/>
        <feature type="ComOther"      n="2"                          name="USB 2.0 (Function / Host)"/>
        <feature type="MPSerial"      n="10"                         name="MFS (Multi-Function Serial Interface) : UART, CSIO, LIN, I2C, I2S(ch.1 only)"/>
        <feature type="DMA"           n="8"                          name="DMA Controller"/>
        <feature type="Other"         n="256"                        name="DSTC Controller (Descriptor System data Transfer Controller) (256 channels)"/>
        <feature type="Timer"         n="16"                         name="Base Timer (Max 16 channels): PWM, PPG, PWC"/>
        <feature type="Timer"         n="2"                          name="Multi-Function Timer (MFT)"/>
        <feature type="RTC"           n="1"       m="32768"          name="Real-time clock (RTC)"/>
        <feature type="Other"         n="4"                          name="Quadrature Position/Revolution Counter (QPRC)"/>
        <feature type="Timer"         n="1"                          name="Dual Timer (32/16-bit Down Counter)"/>
        <feature type="Timer"         n="1"                          name="Watch Counter"/>
        <feature type="ExtInt"        n="32"                         name="External Interrupt Controller Unit"/>
        <feature type="WDT"           n="1"                          name="Watchdog Timer (HW + SW)"/>
        <feature type="Other"         n="1"                          name="CRC (Cyclic Redundancy Check) Accelerator "/>
        <feature type="ETH"           n="1"       m="100000000"      name="Ethernet MAC"/>
        <feature type="ComOther"      n="2"                          name="IC Card (Smart Card) Interface"/>
        <feature type="XTAL"          n="4000000" m="48000000"       name="Main Clock"/>
        <feature type="XTAL"          n="30000"   m="100000"         name="32.768kHz Sub Clock"/>
        <feature type="IntRC"         n="4000000"                    name="Built-in CR High-speed (+/- 2%)"/>
        <feature type="IntRC"         n="100000"                     name="Built-in CR Low-speed"/>
        <feature type="Other"         n="1"                          name="Clock Super Visor (CSV)"/>
        <feature type="Other"         n="2"                          name="Low-Voltage Detector (LVD)"/>
        <feature type="PowerMode"     n="6"                          name="Low-Power Consumption Mode: SLEEP, TIMER, RTC, STOP, Deep standby RTC, Deep standby STOP"/>
        <feature type="ClockOther"    n="1"                          name="Peripheral Clock Gating (PCG)"/>
        <feature type="CoreOther"     n="1"                          name="41-bit Unique ID"/>
        <feature type="VCC"           n="2.7"     m="5.5"/>

        <!-- *************************  Device 'S6E2G26H'  ***************************** -->
        <device Dname="S6E2G26H">
          <compile header="Device/S6E2G2/Include/S6E2G2xH/s6e2g2xh.h" define="S6E2G26H"/>
          <debug svd="SVD/s6e2g2xh.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFF0000" size="0x00010000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2G2XX0A1024KB.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20040000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"  n="16"           name="External Bus Interface for SRAM, NOR, NAND FLash and SDRAM"/>
          <feature type="IOs"     n="121"          name="General Purpose I/Os"/>
          <feature type="ADC"     n="24"   m="12"  name="AD converter"/>
          <feature type="QFP"     n="144"          name="Plastic LQFP: FPT-144P-M08 (0.5mm pitch)"/>
        </device>

        <!-- *************************  Device 'S6E2G28H'  ***************************** -->
        <device Dname="S6E2G28H">
          <compile header="Device/S6E2G2/Include/S6E2G2xH/s6e2g2xh.h" define="S6E2G28H"/>
          <debug svd="SVD/s6e2g2xh.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFE0000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2G2XX0A1024KB.FLM" start="0x00000000" size="0x00100000" RAMstart="0x20040000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus" n="16"           name="External Bus Interface for SRAM, NOR, NAND FLash and SDRAM"/>
          <feature type="IOs"    n="121"          name="General Purpose I/Os"/>
          <feature type="ADC"    n="24"   m="12"  name="AD converter"/>
          <feature type="QFP"    n="144"          name="Plastic LQFP: FPT-144P-M08 (0.5mm pitch)"/>
        </device>

