XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM4_DFP.pdsc
        <!-- *************************  Device 'S6E2G26J'  ***************************** -->
        <device Dname="S6E2G26J">
          <compile header="Device/S6E2G2/Include/S6E2G2xJ/s6e2g2xj.h"  define="S6E2G26J"/>
          <debug svd="SVD/s6e2g2xj.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFF0000" size="0x00010000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2G2XX0A1024KB.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20040000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"  n="16"           name="External Bus Interface for SRAM, NOR, NAND FLash and SDRAM"/>
          <feature type="IOs"     n="153"          name="General Purpose I/Os"/>
          <feature type="ADC"     n="32"   m="12"  name="AD converter"/>
          <feature type="QFP"     n="176"          name="Plastic LQFP: FPT-176P-M07 (0.5mm pitch)"/>
        </device>

        <!-- *************************  Device 'S6E2G28J'  ***************************** -->
        <device Dname="S6E2G28J">
          <compile header="Device/S6E2G2/Include/S6E2G2xJ/s6e2g2xj.h"  define="S6E2G28J"/>
          <debug svd="SVD/s6e2g2xj.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFE0000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2G2XX0A1024KB.FLM" start="0x00000000" size="0x00100000" RAMstart="0x20040000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus"  n="16"           name="External Bus Interface for SRAM, NOR, NAND FLash and SDRAM"/>
          <feature type="IOs"     n="153"          name="General Purpose I/Os"/>
          <feature type="ADC"     n="32"   m="12"  name="AD converter"/>
          <feature type="QFP"     n="176"          name="Plastic LQFP: FPT-176P-M07 (0.5mm pitch)"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'S6E2G3'  *************************** -->
      <subFamily DsubFamily="S6E2G3">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="180000000"/>
        <book name="Documents/3089329-001-99445.pdf" title="S6E2G3 Datasheet"/>
        <memory id="IROM2"                        start="0x00406000" size="0x00002000" startup="0" default="1"/>
        <memory id="IRAM2"                        start="0x20038000" size="0x00010000" init="0"    default="0"/>
        <algorithm name="Flash/S6E2G3XX0A8KB.FLM" start="0x00406000" size="0x00002000" RAMstart="0x20040000" RAMsize="0x1000" default="1"/>

        <feature type="NVIC"          n="128"                        name="NVIC"/>
        <feature type="ComOther"      n="2"                          name="USB 2.0 (Function / Host)"/>
        <feature type="MPSerial"      n="10"                         name="MFS (Multi-Function Serial Interface) : UART, CSIO, LIN, I2C, I2S(ch.1 only)"/>
        <feature type="DMA"           n="8"                          name="DMA Controller"/>
        <feature type="Other"         n="256"                        name="DSTC Controller (Descriptor System data Transfer Controller) (256 channels)"/>
        <feature type="Timer"         n="16"                         name="Base Timer (Max 16 channels): PWM, PPG, PWC"/>
        <feature type="Timer"         n="2"                          name="Multi-Function Timer (MFT)"/>
        <feature type="RTC"           n="1"       m="32768"          name="Real-time clock (RTC)"/>
        <feature type="Other"         n="4"                          name="Quadrature Position/Revolution Counter (QPRC)"/>
        <feature type="Timer"         n="1"                          name="Dual Timer (32/16-bit Down Counter)"/>
        <feature type="Timer"         n="1"                          name="Watch Counter"/>
        <feature type="ExtInt"        n="32"                         name="External Interrupt Controller Unit"/>
        <feature type="WDT"           n="1"                          name="Watchdog Timer (HW + SW)"/>
        <feature type="Other"         n="1"                          name="CRC (Cyclic Redundancy Check) Accelerator "/>
        <feature type="ComOther"      n="2"                          name="IC Card (Smart Card) Interface"/>
        <feature type="XTAL"          n="4000000" m="48000000"       name="Main Clock"/>
        <feature type="XTAL"          n="30000"   m="100000"         name="32.768kHz Sub Clock"/>
        <feature type="IntRC"         n="4000000"                    name="Built-in CR High-speed (+/- 2%)"/>
        <feature type="IntRC"         n="100000"                     name="Built-in CR Low-speed"/>
        <feature type="Other"         n="1"                          name="Clock Super Visor (CSV)"/>
        <feature type="Other"         n="2"                          name="Low-Voltage Detector (LVD)"/>
        <feature type="PowerMode"     n="6"                          name="Low-Power Consumption Mode: SLEEP, TIMER, RTC, STOP, Deep standby RTC, Deep standby STOP"/>
        <feature type="ClockOther"    n="1"                          name="Peripheral Clock Gating (PCG)"/>
        <feature type="CoreOther"     n="1"                          name="41-bit Unique ID"/>
        <feature type="VCC"           n="2.7"     m="5.5"/>

        <!-- *************************  Device 'S6E2G36H'  ***************************** -->
        <device Dname="S6E2G36H">
          <compile header="Device/S6E2G3/Include/S6E2G3xH/s6e2g3xh.h"  define="S6E2G36H"/>
          <debug svd="SVD/s6e2g3xh.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFF0000" size="0x00010000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2G3XX0A1024KB.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20040000" RAMsize="0x1000" default="1"/>

