XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM4_DFP.pdsc
        <!-- *************************  Device 'S6E2GM6H'  ***************************** -->
        <device Dname="S6E2GM6H">
          <compile header="Device/S6E2GM/Include/S6E2GMxH/s6e2gmxh.h" define="S6E2GM6H"/>
          <debug svd="SVD/s6e2gmxh.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFF0000" size="0x00010000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2GMXX0A1024KB.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20040000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus" n="16" name="External Bus Interface for SRAM, NOR, NAND FLash and SDRAM"/>
          <feature type="IOs" n="121" name="General Purpose I/Os"/>
          <feature type="ADC" n="24" m="12" name="AD converter"/>
          <feature type="QFP" n="144" name="Plastic LQFP: FPT-144P-M08 (0.5mm pitch)"/>
        </device>

        <!-- *************************  Device 'S6E2GM8H'  ***************************** -->
        <device Dname="S6E2GM8H">
          <compile header="Device/S6E2GM/Include/S6E2GMxH/s6e2gmxh.h" define="S6E2GM8H"/>
          <debug svd="SVD/s6e2gmxh.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFE0000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2GMXX0A1024KB.FLM" start="0x00000000" size="0x00100000" RAMstart="0x20040000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus" n="16" name="External Bus Interface for SRAM, NOR, NAND FLash and SDRAM"/>
          <feature type="IOs" n="121" name="General Purpose I/Os"/>
          <feature type="ADC" n="24" m="12" name="AD converter"/>
          <feature type="QFP" n="144" name="Plastic LQFP: FPT-144P-M08 (0.5mm pitch)"/>
        </device>

        <!-- *************************  Device 'S6E2GM6J'  ***************************** -->
        <device Dname="S6E2GM6J">
          <compile header="Device/S6E2GM/Include/S6E2GMxJ/s6e2gmxj.h" define="S6E2GM6J"/>
          <debug svd="SVD/s6e2gmxj.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFF0000" size="0x00010000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2GMXX0A1024KB.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20040000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus" n="16" name="External Bus Interface for SRAM, NOR, NAND FLash and SDRAM"/>
          <feature type="IOs" n="153" name="General Purpose I/Os"/>
          <feature type="ADC" n="32" m="12" name="AD converter"/>
          <feature type="QFP" n="176" name="Plastic LQFP: FPT-176P-M07 (0.5mm pitch)"/>
        </device>

        <!-- *************************  Device 'S6E2GM8J'  ***************************** -->
        <device Dname="S6E2GM8J">
          <compile header="Device/S6E2GM/Include/S6E2GMxJ/s6e2gmxj.h" define="S6E2GM8J"/>
          <debug svd="SVD/s6e2gmxj.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFE0000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2GMXX0A1024KB.FLM" start="0x00000000" size="0x00100000" RAMstart="0x20040000" RAMsize="0x1000" default="1"/>

          <feature type="ExtBus" n="16" name="External Bus Interface for SRAM, NOR, NAND FLash and SDRAM"/>
          <feature type="IOs" n="153" name="General Purpose I/Os"/>
          <feature type="ADC" n="32" m="12" name="AD converter"/>
          <feature type="QFP" n="176" name="Plastic LQFP: FPT-176P-M07 (0.5mm pitch)"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'S6E2H1'  *************************** -->
      <subFamily DsubFamily="S6E2H1">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="160000000"/>
        <book name="Documents/s6e2h1_series_32-bit_arm_cortex-m4f_fm4_microcontroller_datasheet.pdf" title="S6E2H1 Datasheet"/>
        <memory id="IROM2"                          start="0x200C0000" size="0x00008000" startup="0" default="1"/>
        <algorithm name="Flash/S6E2H1_WORK32KB.FLM" start="0x200C0000" size="0x00008000"             default="1"/>

        <feature type="NVIC"          n="128"                        name="NVIC"/>
        <feature type="MPSerial"      n="8"                          name="MFS (Multi-Function Serial Interface) : UART, CSIO, LIN, I2C"/>
        <feature type="DMA"           n="8"                          name="DMA Controller"/>
        <feature type="Other"         n="256"                        name="DSTC Controller (Descriptor System data Transfer Controller) (256 channels)"/>
        <feature type="DAC"           n="2"        m="12"            name="DA converter"/>
        <feature type="Timer"         n="8"                          name="Base Timer (Max 8 channels): PWM, PPG, PWC"/>
        <feature type="Timer"         n="3"                          name="Multi-Function Timer (MFT)"/>
        <feature type="RTC"           n="1"        m="32768"         name="Real-time clock (RTC)"/>
        <feature type="Other"         n="3"                          name="Quadrature Position/Revolution Counter (QPRC)"/>
        <feature type="Timer"         n="1"                          name="Dual Timer (32/16-bit Down Counter)"/>
        <feature type="Timer"         n="1"                          name="Watch Counter"/>
        <feature type="ExtInt"        n="16"                         name="External Interrupt Controller Unit"/>
        <feature type="WDT"           n="1"                          name="Watchdog Timer (HW + SW)"/>
        <feature type="Other"         n="1"                          name="CRC (Cyclic Redundancy Check) Accelerator "/>
        <feature type="XTAL"          n="4000000"  m="48000000"      name="Main Clock"/>
        <feature type="XTAL"          n="32000"    m="100000"        name="32.768kHz Sub Clock"/>
        <feature type="IntRC"         n="4000000"                    name="Built-in CR High-speed (+/- 2%)"/>
        <feature type="IntRC"         n="100000"                     name="Built-in CR Low-speed"/>
        <feature type="Other"         n="1"                          name="Clock Super Visor (CSV)"/>
        <feature type="Other"         n="2"                          name="Low-Voltage Detector (LVD)"/>
        <feature type="PowerMode"     n="6"                          name="Low-Power Consumption Mode: SLEEP, TIMER, RTC, STOP, Deep standby RTC, Deep standby STOP"/>
        <feature type="ClockOther"    n="1"                          name="Peripheral Clock Gating (PCG)"/>
        <feature type="PowerOther"    n="1"                          name="VBAT - Independent power supply for RTC and 32kHz oscillator"/>
        <feature type="CoreOther"     n="1"                          name="41-bit Unique ID"/>
        <feature type="VCC"           n="2.7"      m="5.5"/>

        <!-- *************************  Device 'S6E2H14E'  ***************************** -->
        <device Dname="S6E2H14E">
          <compile header="Device/S6E2H1/Include/S6E2H1xE/s6e2h1xe.h" define="S6E2H14E"/>
          <debug svd="SVD/s6e2h1xe.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFFC000" size="0x00004000" init="0"    default="1"/>
          <memory id="IRAM2"                     start="0x2003E000" size="0x00004000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2H14X0A.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <feature type="ExtBus" n="8" name="External Bus Interface for SRAM, NOR FLash"/>
          <feature type="ADC" n="16" m="12" name="AD converter"/>
          <feature type="IOs" n="63" name="General Purpose I/Os"/>
          <feature type="QFP" n="80" name="LQFP: FPT-80P-M37 (0.50mm pitch)"/>
        </device>

        <!-- *************************  Device 'S6E2H16E'  ***************************** -->
        <device Dname="S6E2H16E">
          <compile header="Device/S6E2H1/Include/S6E2H1xE/s6e2h1xe.h" define="S6E2H16E"/>
          <debug svd="SVD/s6e2h1xe.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFF8000" size="0x00008000" init="0"    default="1"/>
          <memory id="IRAM2"                     start="0x2003C000" size="0x00008000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2H16X0A.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="ExtBus" n="8" name="External Bus Interface for SRAM, NOR FLash"/>
          <feature type="ADC" n="16" m="12" name="AD converter"/>
          <feature type="IOs" n="63" name="General Purpose I/Os"/>
          <feature type="QFP" n="80" name="LQFP: FPT-80P-M37 (0.50mm pitch)"/>
        </device>

        <!-- *************************  Device 'S6E2H14F'  ***************************** -->
        <device Dname="S6E2H14F">
          <compile header="Device/S6E2H1/Include/S6E2H1xF/s6e2h1xf.h" define="S6E2H14F"/>
          <debug svd="SVD/s6e2h1xf.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFFC000" size="0x00004000" init="0"    default="1"/>
          <memory id="IRAM2"                     start="0x2003E000" size="0x00004000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2H14X0A.FLM" start="0x00000000" size="0x00040000"             default="1"/>

