XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM4_DFP.pdsc
        <!-- *************************  Device 'S6E2HE4E'  ***************************** -->
        <device Dname="S6E2HE4E">
          <compile header="Device/S6E2HE/Include/S6E2HExE/s6e2hexe.h" define="S6E2HE4E"/>
          <debug svd="SVD/s6e2hexe.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFFC000" size="0x00004000" init="0"    default="1"/>
          <memory id="IRAM2"                     start="0x2003E000" size="0x00004000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2HE4X0A.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <feature type="ExtBus" n="8" name="External Bus Interface for SRAM, NOR FLash"/>
          <feature type="ADC" n="16" m="12" name="AD converter"/>
          <feature type="IOs" n="63" name="General Purpose I/Os"/>
          <feature type="QFP" n="80" name="LQFP: FPT-80P-M37 (0.50mm pitch)"/>
        </device>

        <!-- *************************  Device 'S6E2HE6E'  ***************************** -->
        <device Dname="S6E2HE6E">
          <compile header="Device/S6E2HE/Include/S6E2HExE/s6e2hexe.h" define="S6E2HE6E"/>
          <debug svd="SVD/s6e2hexe.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFF8000" size="0x00008000" init="0"    default="1"/>
          <memory id="IRAM2"                     start="0x2003C000" size="0x00008000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2HE6X0A.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="ExtBus" n="8" name="External Bus Interface for SRAM, NOR FLash"/>
          <feature type="ADC" n="16" m="12" name="AD converter"/>
          <feature type="IOs" n="63" name="General Purpose I/Os"/>
          <feature type="QFP" n="80" name="LQFP: FPT-80P-M37 (0.50mm pitch)"/>
        </device>

        <!-- *************************  Device 'S6E2HE4F'  ***************************** -->
        <device Dname="S6E2HE4F">
          <compile header="Device/S6E2HE/Include/S6E2HExF/s6e2hexf.h" define="S6E2HE4F"/>
          <debug svd="SVD/s6e2hexf.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFFC000" size="0x00004000" init="0"    default="1"/>
          <memory id="IRAM2"                     start="0x2003E000" size="0x00004000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2HE4X0A.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <feature type="ExtBus" n="16" name="External Bus Interface for SRAM, NOR FLash and SDRAM"/>
          <feature type="ADC" n="24" m="12" name="AD converter"/>
          <feature type="IOs" n="80" name="General Purpose I/Os"/>
          <feature type="QFP" n="100" name="LQFP: FPT-100P-M23 (0.50mm pitch)"/>
        </device>

        <!-- *************************  Device 'S6E2HE6F'  ***************************** -->
        <device Dname="S6E2HE6F">
          <compile header="Device/S6E2HE/Include/S6E2HExF/s6e2hexf.h" define="S6E2HE6F"/>
          <debug svd="SVD/s6e2hexf.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFF8000" size="0x00008000" init="0"    default="1"/>
          <memory id="IRAM2"                     start="0x2003C000" size="0x00008000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2HE6X0A.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="ExtBus" n="16" name="External Bus Interface for SRAM, NOR FLash and SDRAM"/>
          <feature type="ADC" n="24" m="12" name="AD converter"/>
          <feature type="IOs" n="80" name="General Purpose I/Os"/>
          <feature type="QFP" n="100" name="LQFP: FPT-100P-M23 (0.50mm pitch)"/>
        </device>

        <!-- *************************  Device 'S6E2HE4G'  ***************************** -->
        <device Dname="S6E2HE4G">
          <compile header="Device/S6E2HE/Include/S6E2HExG/s6e2hexg.h" define="S6E2HE4G"/>
          <debug svd="SVD/s6e2hexg.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFFC000" size="0x00004000" init="0"    default="1"/>
          <memory id="IRAM2"                     start="0x2003E000" size="0x00004000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2HE4X0A.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <feature type="ExtBus" n="16" name="External Bus Interface for SRAM, NOR, NAND FLash and SDRAM"/>
          <feature type="ADC" n="24" m="12" name="AD converter"/>
          <feature type="IOs" n="100" name="General Purpose I/Os"/>
          <feature type="QFP" n="120" name="LQFP: FPT-120P-M37 (0.50mm pitch)"/>
          <feature type="BGA" n="121" name="BGA: FDI121 (0.50mm pitch)"/>
        </device>

        <!-- *************************  Device 'S6E2HE6G'  ***************************** -->
        <device Dname="S6E2HE6G">
          <compile header="Device/S6E2HE/Include/S6E2HExG/s6e2hexg.h" define="S6E2HE6G"/>
          <debug svd="SVD/s6e2hexg.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFF8000" size="0x00008000" init="0"    default="1"/>
          <memory id="IRAM2"                     start="0x2003C000" size="0x00008000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2HE6X0A.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="ExtBus" n="16" name="External Bus Interface for SRAM, NOR, NAND FLash and SDRAM"/>
          <feature type="ADC" n="24" m="12" name="AD converter"/>
          <feature type="IOs" n="100" name="General Purpose I/Os"/>
          <feature type="QFP" n="120" name="LQFP: FPT-120P-M37 (0.50mm pitch)"/>
          <feature type="BGA" n="121" name="BGA: FDI121 (0.50mm pitch)"/>
        </device>
      </subFamily>

