XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM4_DFP.pdsc
      <!-- ************************  Subfamily 'S6E2HG'  *************************** -->
      <subFamily DsubFamily="S6E2HG">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="160000000"/>
        <book name="Documents/s6e2hg_series_32-bit_arm_cortex-m4f_fm4_microcontroller_datasheet.pdf" title="S6E2HG Datasheet"/>
        <memory id="IROM2"                          start="0x200C0000" size="0x00008000" startup="0" default="1"/>
        <algorithm name="Flash/S6E2HG_WORK32KB.FLM" start="0x200C0000" size="0x00008000"             default="1"/>

        <feature type="NVIC"          n="128"                        name="NVIC"/>
        <feature type="CAN"           n="2"                          name="CAN Interface, compatible with CAN specification 2.0A/B"/>
        <feature type="MPSerial"      n="8"                          name="MFS (Multi-Function Serial Interface) : UART, CSIO, LIN, I2C"/>
        <feature type="DMA"           n="8"                          name="DMA Controller"/>
        <feature type="Other"         n="256"                        name="DSTC Controller (Descriptor System data Transfer Controller) (256 channels)"/>
        <feature type="DAC"           n="2"        m="12"            name="DA converter"/>
        <feature type="Timer"         n="8"                          name="Base Timer (Max 8 channels): PWM, PPG, PWC"/>
        <feature type="Timer"         n="3"                          name="Multi-Function Timer (MFT)"/>
        <feature type="RTC"           n="1"        m="32768"         name="Real-time clock (RTC)"/>
        <feature type="Other"         n="3"                          name="Quadrature Position/Revolution Counter (QPRC)"/>
        <feature type="Timer"         n="1"                          name="Dual Timer (32/16-bit Down Counter)"/>
        <feature type="Timer"         n="1"                          name="Watch Counter"/>
        <feature type="ExtInt"        n="16"                         name="External Interrupt Controller Unit"/>
        <feature type="WDT"           n="1"                          name="Watchdog Timer (HW + SW)"/>
        <feature type="Other"         n="1"                          name="CRC (Cyclic Redundancy Check) Accelerator "/>
        <feature type="SDIO"          n="1"                          name="SD Card Interface supported 1-bit or 4-bit data bus"/>
        <feature type="XTAL"          n="4000000"  m="48000000"      name="Main Clock"/>
        <feature type="XTAL"          n="32000"    m="100000"        name="32.768kHz Sub Clock"/>
        <feature type="IntRC"         n="4000000"                    name="Built-in CR High-speed (+/- 2%)"/>
        <feature type="IntRC"         n="100000"                     name="Built-in CR Low-speed"/>
        <feature type="Other"         n="1"                          name="Clock Super Visor (CSV)"/>
        <feature type="Other"         n="2"                          name="Low-Voltage Detector (LVD)"/>
        <feature type="PowerMode"     n="6"                          name="Low-Power Consumption Mode: SLEEP, TIMER, RTC, STOP, Deep standby RTC, Deep standby STOP"/>
        <feature type="ClockOther"    n="1"                          name="Peripheral Clock Gating (PCG)"/>
        <feature type="PowerOther"    n="1"                          name="VBAT - Independent power supply for RTC and 32kHz oscillator"/>
        <feature type="CoreOther"     n="1"                          name="41-bit Unique ID"/>
        <feature type="VCC"           n="2.7"      m="5.5"/>

        <!-- *************************  Device 'S6E2HG4E'  ***************************** -->
        <device Dname="S6E2HG4E">
          <compile header="Device/S6E2HG/Include/S6E2HGxE/s6e2hgxe.h" define="S6E2HG4E"/>
          <debug svd="SVD/s6e2hgxe.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFFC000" size="0x00004000" init="0"    default="1"/>
          <memory id="IRAM2"                     start="0x2003E000" size="0x00004000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2HG4X0A.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <feature type="ExtBus" n="8" name="External Bus Interface for SRAM, NOR FLash"/>
          <feature type="ADC" n="16" m="12" name="AD converter"/>
          <feature type="IOs" n="63" name="General Purpose I/Os"/>
          <feature type="QFP" n="80" name="LQFP: FPT-80P-M37 (0.50mm pitch)"/>
        </device>

        <!-- *************************  Device 'S6E2HG6E'  ***************************** -->
        <device Dname="S6E2HG6E">
          <compile header="Device/S6E2HG/Include/S6E2HGxE/s6e2hgxe.h" define="S6E2HG6E"/>
          <debug svd="SVD/s6e2hgxe.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFF8000" size="0x00008000" init="0"    default="1"/>
          <memory id="IRAM2"                     start="0x2003C000" size="0x00008000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2HG6X0A.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="ExtBus" n="8" name="External Bus Interface for SRAM, NOR FLash"/>
          <feature type="ADC" n="16" m="12" name="AD converter"/>
          <feature type="IOs" n="63" name="General Purpose I/Os"/>
          <feature type="QFP" n="80" name="LQFP: FPT-80P-M37 (0.50mm pitch)"/>
        </device>

        <!-- *************************  Device 'S6E2HG4F'  ***************************** -->
        <device Dname="S6E2HG4F">
          <compile header="Device/S6E2HG/Include/S6E2HGxF/s6e2hgxf.h" define="S6E2HG4F"/>
          <debug svd="SVD/s6e2hgxf.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFFC000" size="0x00004000" init="0"    default="1"/>
          <memory id="IRAM2"                     start="0x2003E000" size="0x00004000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2HG4X0A.FLM" start="0x00000000" size="0x00040000"             default="1"/>

