XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM4_DFP.pdsc
          <feature type="ExtBus" n="16" name="External Bus Interface for SRAM, NOR FLash and SDRAM"/>
          <feature type="ADC" n="24" m="12" name="AD converter"/>
          <feature type="IOs" n="80" name="General Purpose I/Os"/>
          <feature type="QFP" n="100" name="LQFP: FPT-100P-M23 (0.50mm pitch)"/>
        </device>

        <!-- *************************  Device 'S6E2HG6F'  ***************************** -->
        <device Dname="S6E2HG6F">
          <compile header="Device/S6E2HG/Include/S6E2HGxF/s6e2hgxf.h" define="S6E2HG6F"/>
          <debug svd="SVD/s6e2hgxf.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFF8000" size="0x00008000" init="0"    default="1"/>
          <memory id="IRAM2"                     start="0x2003C000" size="0x00008000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2HG6X0A.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="ExtBus" n="16" name="External Bus Interface for SRAM, NOR FLash and SDRAM"/>
          <feature type="ADC" n="24" m="12" name="AD converter"/>
          <feature type="IOs" n="80" name="General Purpose I/Os"/>
          <feature type="QFP" n="100" name="LQFP: FPT-100P-M23 (0.50mm pitch)"/>
        </device>

        <!-- *************************  Device 'S6E2HG4G'  ***************************** -->
        <device Dname="S6E2HG4G">
          <compile header="Device/S6E2HG/Include/S6E2HGxG/s6e2hgxg.h" define="S6E2HG4G"/>
          <debug svd="SVD/s6e2hgxg.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFFC000" size="0x00004000" init="0"    default="1"/>
          <memory id="IRAM2"                     start="0x2003E000" size="0x00004000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2HG4X0A.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <feature type="ExtBus" n="16" name="External Bus Interface for SRAM, NOR, NAND FLash and SDRAM"/>
          <feature type="ADC" n="24" m="12" name="AD converter"/>
          <feature type="IOs" n="100" name="General Purpose I/Os"/>
          <feature type="QFP" n="120" name="LQFP: FPT-120P-M37 (0.50mm pitch)"/>
          <feature type="BGA" n="121" name="BGA: FDI121 (0.50mm pitch)"/>
        </device>

        <!-- *************************  Device 'S6E2HG6G'  ***************************** -->
        <device Dname="S6E2HG6G">
          <compile header="Device/S6E2HG/Include/S6E2HGxG/s6e2hgxg.h" define="S6E2HG6G"/>
          <debug svd="SVD/s6e2hgxg.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFF8000" size="0x00008000" init="0"    default="1"/>
          <memory id="IRAM2"                     start="0x2003C000" size="0x00008000" init="0"    default="1"/>
          <algorithm name="Flash/S6E2HG6X0A.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="ExtBus" n="16" name="External Bus Interface for SRAM, NOR, NAND FLash and SDRAM"/>
          <feature type="ADC" n="24" m="12" name="AD converter"/>
          <feature type="IOs" n="100" name="General Purpose I/Os"/>
          <feature type="QFP" n="120" name="LQFP: FPT-120P-M37 (0.50mm pitch)"/>
          <feature type="BGA" n="121" name="BGA: FDI121 (0.50mm pitch)"/>
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="MB9B160L CMSIS">
      <description>Cypress FM4 MB9B160L Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="MB9BF16[456][KL]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="MB9B160R CMSIS">
      <description>Cypress FM4 MB9B160R Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="MB9BF16[678][MNR]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="MB9B360L CMSIS">
      <description>Cypress FM4 MB9B360L Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="MB9BF36[456][KL]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="MB9B360R CMSIS">
      <description>Cypress FM4 MB9B360R Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="MB9BF36[678][MNR]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="MB9B460L CMSIS">
      <description>Cypress FM4 MB9B460L Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="MB9BF46[456][KL]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="MB9B460R CMSIS">
      <description>Cypress FM4 MB9B460R Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="MB9BF46[678][MNR]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="MB9B560L CMSIS">
      <description>Cypress FM4 MB9B560L Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="MB9BF56[456][KL]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="MB9B560R CMSIS">
      <description>Cypress FM4 MB9B560R Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="MB9BF56[678][MNR]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="S6E2C1 CMSIS">
      <description>Cypress FM4 S6E2C1 Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2C1[89A][HJL]0A"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="S6E2C2 CMSIS">
      <description>Cypress FM4 S6E2C2 Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2C2[89A][HJL]0A"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
