XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM4_DFP.pdsc
    <condition id="S6E2C3 CMSIS">
      <description>Cypress FM4 S6E2C3 Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2C3[89A][HJL]0A"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="S6E2C4 CMSIS">
      <description>Cypress FM4 S6E2C4 Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2C4[89A][HJL]0A"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="S6E2C5 CMSIS">
      <description>Cypress FM4 S6E2C5 Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2C5[89A][HJL]0A"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="S6E2CC CMSIS">
      <description>Cypress FM4 S6E2CC Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2CC[89A][HJL]0A"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="S6E2D3 CMSIS">
      <description>Cypress FM4 S6E2D3 Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2D3[5][GJ][0AJ]A"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="S6E2D5 CMSIS">
      <description>Cypress FM4 S6E2D5 Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2D5[5][GJ][0AJ]A"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="S6E2DF CMSIS">
      <description>Cypress FM4 S6E2DF Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2DF[5][GJ][0AJ]A"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="S6E2DH CMSIS">
      <description>Cypress FM4 S6E2DH Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2DH[5][GJ][0AJ]A"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="S6E2G2 CMSIS">
      <description>Cypress FM4 S6E2G2 Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2G2[68][JH]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="S6E2G3 CMSIS">
      <description>Cypress FM4 S6E2G3 Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2G3[68][JH]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="S6E2GH CMSIS">
      <description>Cypress FM4 S6E2GH Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2GH[68][JH]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="S6E2GK CMSIS">
      <description>Cypress FM4 S6E2GK Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2GK[68][JH]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="S6E2GM CMSIS">
      <description>Cypress FM4 S6E2GM Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2GM[68][JH]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="S6E2H1 CMSIS">
      <description>Cypress FM4 S6E2H1 Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2H1[46][EFG]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="S6E2H4 CMSIS">
      <description>Cypress FM4 S6E2H4 Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2H4[46][EFG]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="S6E2HE CMSIS">
      <description>Cypress FM4 S6E2HE Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2HE[46][EFG]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="S6E2HG CMSIS">
      <description>Cypress FM4 S6E2HG Device and CMSIS-CORE</description>
      <require Dvendor="Cypress:19" Dname="S6E2HG[46][EFG]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="MB9B160L CMSIS">
      <description>System Startup for Cypress MB9B160L Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/MB9B160L/Include/"/>
        <file category="header"  name="Device/MB9B160L/Include/mb9b160l.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device/MB9B160L/Source/ARM/startup_mb9bf16xl.s" attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/MB9B160L/Source/system_mb9abxxx.c"       attr="config" version="1.1.0"/>
        <file category="header" name="Device/MB9B160L/Source/system_mb9bf16xl.h"      attr="config" version="1.1.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="MB9B160R CMSIS">
      <description>System Startup for Cypress MB9B160R Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/MB9B160R/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/MB9B160R/Source/ARM/startup_mb9bf16xr.s" attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/MB9B160R/Source/system_mb9abxxx.c"       attr="config" version="1.1.0"/>
        <file category="header" name="Device/MB9B160R/Source/system_mb9bf16xr.h"      attr="config" version="1.1.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="MB9B360L CMSIS">
      <description>System Startup for Cypress MB9B360L Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/MB9B360L/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/MB9B360L/Source/ARM/startup_mb9bf36xl.s" attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/MB9B360L/Source/system_mb9abxxx.c"       attr="config" version="1.1.0"/>
        <file category="header" name="Device/MB9B360L/Source/system_mb9bf36xl.h"      attr="config" version="1.1.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="MB9B360R CMSIS">
      <description>System Startup for Cypress MB9B360R Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/MB9B360R/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/MB9B360R/Source/ARM/startup_mb9bf36xr.s" attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/MB9B360R/Source/system_mb9abxxx.c"       attr="config" version="1.1.0"/>
        <file category="header" name="Device/MB9B360R/Source/system_mb9bf36xr.h"      attr="config" version="1.1.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="MB9B460L CMSIS">
      <description>System Startup for Cypress MB9B460L Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/MB9B460L/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/MB9B460L/Source/ARM/startup_mb9bf46xl.s" attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/MB9B460L/Source/system_mb9abxxx.c"       attr="config" version="1.1.0"/>
        <file category="header" name="Device/MB9B460L/Source/system_mb9bf46xl.h"      attr="config" version="1.1.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="MB9B460R CMSIS">
      <description>System Startup for Cypress MB9B460R Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/MB9B460R/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/MB9B460R/Source/ARM/startup_mb9bf46xr.s" attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/MB9B460R/Source/system_mb9abxxx.c"       attr="config" version="1.1.0"/>
        <file category="header" name="Device/MB9B460R/Source/system_mb9bf46xr.h"      attr="config" version="1.1.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="MB9B560L CMSIS">
      <description>System Startup for Cypress MB9B560L Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/MB9B560L/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/MB9B560L/Source/ARM/startup_mb9bf56xl.s" attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/MB9B560L/Source/system_mb9abxxx.c"       attr="config" version="1.1.0"/>
        <file category="header" name="Device/MB9B560L/Source/system_mb9bf56xl.h"      attr="config" version="1.1.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="MB9B560R CMSIS">
      <description>System Startup for Cypress MB9B560R Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/MB9B560R/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/MB9B560R/Source/ARM/startup_mb9bf56xr.s" attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/MB9B560R/Source/system_mb9abxxx.c"       attr="config" version="1.1.0"/>
        <file category="header" name="Device/MB9B560R/Source/system_mb9bf56xr.h"      attr="config" version="1.1.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2C1 CMSIS">
      <description>System Startup for Cypress S6E2C1 Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/S6E2C1/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/S6E2C1/Source/ARM/startup_s6e2c1.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2C1/Source/system_s6e2c1.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2C1/Source/system_s6e2c1.h"           attr="config" version="1.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2C2 CMSIS">
      <description>System Startup for Cypress S6E2C2 Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/S6E2C2/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/S6E2C2/Source/ARM/startup_s6e2c2.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2C2/Source/system_s6e2c2.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2C2/Source/system_s6e2c2.h"           attr="config" version="1.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2C3 CMSIS">
      <description>System Startup for Cypress S6E2C3 Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/S6E2C3/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/S6E2C3/Source/ARM/startup_s6e2c3.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2C3/Source/system_s6e2c3.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2C3/Source/system_s6e2c3.h"           attr="config" version="1.0.0"/>
      </files>
    </component>

