XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM4_DFP.pdsc
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2C4 CMSIS">
      <description>System Startup for Cypress S6E2C4 Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/S6E2C4/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/S6E2C4/Source/ARM/startup_s6e2c4.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2C4/Source/system_s6e2c4.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2C4/Source/system_s6e2c4.h"           attr="config" version="1.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2C5 CMSIS">
      <description>System Startup for Cypress S6E2C5 Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/S6E2C5/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/S6E2C5/Source/ARM/startup_s6e2c5.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2C5/Source/system_s6e2c5.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2C5/Source/system_s6e2c5.h"           attr="config" version="1.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2CC CMSIS">
      <description>System Startup for Cypress S6E2CC Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/S6E2CC/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/S6E2CC/Source/ARM/startup_s6e2cc.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2CC/Source/system_s6e2cc.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2CC/Source/system_s6e2cc.h"           attr="config" version="1.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2D3 CMSIS">
      <description>System Startup for Cypress S6E2D3 Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/S6E2D3/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/S6E2D3/Source/ARM/startup_s6e2d3.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2D3/Source/system_s6e2d3.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2D3/Source/system_s6e2d3.h"           attr="config" version="1.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2D5 CMSIS">
      <description>System Startup for Cypress S6E2D5 Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/S6E2D5/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/S6E2D5/Source/ARM/startup_s6e2d5.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2D5/Source/system_s6e2d5.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2D5/Source/system_s6e2d5.h"           attr="config" version="1.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2DF CMSIS">
      <description>System Startup for Cypress S6E2DF Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/S6E2DF/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/S6E2DF/Source/ARM/startup_s6e2df.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2DF/Source/system_s6e2df.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2DF/Source/system_s6e2df.h"           attr="config" version="1.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2DH CMSIS">
      <description>System Startup for Cypress S6E2DH Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/S6E2DH/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/S6E2DH/Source/ARM/startup_s6e2dh.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2DH/Source/system_s6e2dh.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2DH/Source/system_s6e2dh.h"           attr="config" version="1.0.0"/>
      </files>
    </component>


    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2G2 CMSIS">
      <description>System Startup for Cypress S6E2G2 Series</description>
      <files>
        <!--file category="include" name="Device/S6E2G2/Include/"/-->
        <file category="include" name="Device/S6E2G2/Include/Common/"/>

        <file category="source" name="Device/S6E2G2/Source/ARM/startup_s6e2g2.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2G2/Source/system_s6e2g2.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2G2/Source/system_s6e2g2.h"           attr="config" version="1.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2G3 CMSIS">
      <description>System Startup for Cypress S6E2G3 Series</description>
      <files>
        <!--file category="include" name="Device/S6E2G3/Include/"/-->
        <file category="include" name="Device/S6E2G3/Include/Common/"/>

        <file category="source" name="Device/S6E2G3/Source/ARM/startup_s6e2g3.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2G3/Source/system_s6e2g3.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2G3/Source/system_s6e2g3.h"           attr="config" version="1.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2GH CMSIS">
      <description>System Startup for Cypress S6E2GH Series</description>
      <files>
        <!--file category="include" name="Device/S6E2GH/Include/"/-->
        <file category="include" name="Device/S6E2GH/Include/Common/"/>

        <file category="source" name="Device/S6E2GH/Source/ARM/startup_s6e2gh.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2GH/Source/system_s6e2gh.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2GH/Source/system_s6e2gh.h"           attr="config" version="1.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2GK CMSIS">
      <description>System Startup for Cypress S6E2GK Series</description>
      <files>
        <!--file category="include" name="Device/S6E2GK/Include/"/-->
        <file category="include" name="Device/S6E2GK/Include/Common/"/>

        <file category="source" name="Device/S6E2GK/Source/ARM/startup_s6e2gk.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2GK/Source/system_s6e2gk.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2GK/Source/system_s6e2gk.h"           attr="config" version="1.0.0"/>
      </files>
    </component>

