XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM4_DFP.pdsc
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2GM CMSIS">
      <description>System Startup for Cypress S6E2GM Series</description>
      <files>
        <!--file category="include" name="Device/S6E2GM/Include/"/-->
        <file category="include" name="Device/S6E2GM/Include/Common/"/>

        <file category="source" name="Device/S6E2GM/Source/ARM/startup_s6e2gm.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2GM/Source/system_s6e2gm.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2GM/Source/system_s6e2gm.h"           attr="config" version="1.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2H1 CMSIS">
      <description>System Startup for Cypress S6E2H1 Series</description>
      <files>
        <!--file category="include" name="Device/S6E2H1/Include/"/-->
        <file category="include" name="Device/S6E2H1/Include/Common/"/>

        <file category="source" name="Device/S6E2H1/Source/ARM/startup_s6e2h1.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2H1/Source/system_s6e2h1.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2H1/Source/system_s6e2h1.h"           attr="config" version="1.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2H4 CMSIS">
      <description>System Startup for Cypress S6E2H4 Series</description>
      <files>
        <!--file category="include" name="Device/S6E2H4/Include/"/-->
        <file category="include" name="Device/S6E2H4/Include/Common/"/>

        <file category="source" name="Device/S6E2H4/Source/ARM/startup_s6e2h4.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2H4/Source/system_s6e2h4.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2H4/Source/system_s6e2h4.h"           attr="config" version="1.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2HE CMSIS">
      <description>System Startup for Cypress S6E2HE Series</description>
      <files>
        <!--file category="include" name="Device/S6E2HE/Include/"/-->
        <file category="include" name="Device/S6E2HE/Include/Common/"/>

        <file category="source" name="Device/S6E2HE/Source/ARM/startup_s6e2he.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2HE/Source/system_s6e2he.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2HE/Source/system_s6e2he.h"           attr="config" version="1.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S6E2HG CMSIS">
      <description>System Startup for Cypress S6E2HG Series</description>
      <files>
        <!--file category="include" name="Device/S6E2HG/Include/"/-->
        <file category="include" name="Device/S6E2HG/Include/Common/"/>

        <file category="source" name="Device/S6E2HG/Source/ARM/startup_s6e2hg.s"      attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/S6E2HG/Source/system_s6e2hg.c"           attr="config" version="1.0.0"/>
        <file category="header" name="Device/S6E2HG/Source/system_s6e2hg.h"           attr="config" version="1.0.0"/>
      </files>
    </component>
  </components>

</package>
